GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    #ifdef BSP_USING_UART2
    {
        USART2,                                /* uart peripheral index */
        RCU_USART2,                            /* uart periph clock */
        USART2_IRQn,                           /* uart iqrn */
        "uart2",
        &serial2,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART2_TX_USING_DMA
        &uart2_txdma,
#endif
#ifdef BSP_UART2_RX_USING_DMA
        &uart2_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART3
    {
        UART3,                                 /* uart peripheral index */
        RCU_UART3,                             /* uart periph clock */
        UART3_IRQn,                            /* uart iqrn */
        "uart3",
        &serial3,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART3_TX_USING_DMA
        &uart3_txdma,
#endif
#ifdef BSP_UART3_RX_USING_DMA
        &uart3_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART4
    {
        UART4,                                 /* uart peripheral index */
        RCU_UART4,                             /* uart periph clock */
        UART4_IRQn,                            /* uart iqrn */
        "uart4",
        &serial4,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART4_TX_USING_DMA
        &uart4_txdma,
#endif
#ifdef BSP_UART4_RX_USING_DMA
        &uart4_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART5
    {
        USART5,                                /* uart peripheral index */
        RCU_USART5,                            /* uart periph clock */
        USART5_IRQn,                           /* uart iqrn */
        "uart5",
        &serial5,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART5_TX_USING_DMA
        &uart5_txdma,
#endif
#ifdef BSP_UART5_RX_USING_DMA
        &uart5_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART6
    {
        UART6,                                 /* uart peripheral index */
        RCU_UART6,                             /* uart periph clock */
        UART6_IRQn,                            /* uart iqrn */
        "uart6",
        &serial6,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART6_TX_USING_DMA
        &uart6_txdma,
#endif
#ifdef BSP_UART6_RX_USING_DMA
        &uart6_rxdma,
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART7
    {
        UART7,                                 /* uart peripheral index */
        RCU_UART7,                             /* uart periph clock */
        UART7_IRQn,                            /* uart iqrn */
        "uart7",
        &serial7,
#ifdef RT_SERIAL_USING_DMA
#ifdef BSP_UART7_TX_USING_DMA
        &uart7_txdma,
#endif
#ifdef BSP_UART7_RX_USING_DMA
        &uart7_rxdma,
#endif
#endif
    },
    #endif
};
#endif

/*******************************************************************************
 * DMA helper functions
 ******************************************************************************/
#ifdef RT_SERIAL_USING_DMA
static void dma_tx_done_isr(uint32_t dma_periph, dma_channel_enum dma_ch)
{
    dma_channel_disable(dma_periph, dma_ch);
    dma_flag_clear(dma_periph, dma_ch, DMA_FLAG_FTF);
    dma_flag_clear(dma_periph, dma_ch, DMA_FLAG_HTF);
    dma_flag_clear(dma_periph, dma_ch, DMA_FLAG_FEE);
    dma_flag_clear(dma_periph, dma_ch, DMA_FLAG_TAE);
}

static void Error_Handler(void)
{
    RT_ASSERT(0);
}
#endif

/*******************************************************************************
 * ISR handlers
 ******************************************************************************/
#if defined(BSP_USING_UART0)

#if defined(BSP_UART0_RX_USING_DMA)
void UART0_DMA_RX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_rx_done_isr(&serial0);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_UART0_TX_USING_DMA)
void UART0_DMA_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_tx_done_isr(UART0_TX_DMA_PERIPH, UART0_TX_DMA_CHANNEL);
    rt_interrupt_leave();
}
#endif

void USART0_IRQHandler(void)
{
    rt_interrupt_enter();
    GD32_UART_IRQHandler(&serial0);
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART0 */

#if defined(BSP_USING_UART1)

#if defined(BSP_UART1_RX_USING_DMA)
void UART1_DMA_RX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_rx_done_isr(&serial1);
    rt_interrupt_leave();
}
#endif

#ifdef BSP_UART1_TX_USING_DMA
void UART1_DMA_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_tx_done_isr(UART1_TX_DMA_PERIPH, UART1_TX_DMA_CHANNEL);
    rt_interrupt_leave();
}
#endif /* RT_SERIAL_USING_DMA */

void USART1_IRQHandler(void)
{
    rt_interrupt_enter();
    GD32_UART_IRQHandler(&serial1);
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)

#if defined(RT_SERIAL_USING_DMA)
#if defined(BSP_UART2_RX_USING_DMA)
void UART2_DMA_RX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_rx_done_isr(&serial2);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_UART2_TX_USING_DMA)
void UART2_DMA_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_tx_done_isr(UART2_TX_DMA_PERIPH, UART2_TX_DMA_CHANNEL);
    rt_interrupt_leave();
}
#endif
#endif /* RT_SERIAL_USING_DMA */

void USART2_IRQHandler(void)
{
    rt_interrupt_enter();
    GD32_UART_IRQHandler(&serial2);
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)

#if defined(RT_SERIAL_USING_DMA)
#ifdef BSP_UART3_RX_USING_DMA
void UART3_DMA_RX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_rx_done_isr(&serial3);
    rt_interrupt_leave();
}
#endif

#ifdef BSP_UART3_TX_USING_DMA
void UART3_DMA_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_tx_done_isr(UART3_TX_DMA_PERIPH, UART3_TX_DMA_CHANNEL);
    rt_interrupt_leave();
}
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART3_IRQHandler(void)
{
    rt_interrupt_enter();
    GD32_UART_IRQHandler(&serial3);
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)

#if defined(RT_SERIAL_USING_DMA)
#ifdef BSP_UART4_RX_USING_DMA
void UART4_DMA_RX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_rx_done_isr(&serial4);
    rt_interrupt_leave();
}
#endif
#ifdef BSP_UART4_TX_USING_DMA
void UART4_DMA_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    dma_tx_done_isr(UART4_TX_DMA_PERIPH, UART4_TX_DMA_CHANNEL);
    rt_interrupt_leave();
}
#endif
#endif /* RT_SERIAL_USING_DMA */

void UART4_IRQHandler(void)
{
    rt_interrupt_enter();
    GD32_UART_IRQHandler(&serial4);
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART4 */

