GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
    return RT_EOK;
}

/**
  * @brief  uart control
  * @param  serial, arg
  * @retval None
  */
static rt_err_t gd32_uart_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct gd32_uart *uart;

#ifdef RT_SERIAL_USING_DMA
    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;
#endif

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        NVIC_DisableIRQ(uart->irqn);
        /* disable interrupt */
#if defined SOC_SERIES_GD32E51x
        if (uart->uart_periph == USART5)
        {
            usart5_interrupt_disable(USART5, USART5_INT_RBNE);
        }
        else
#endif
        {
            usart_interrupt_disable(uart->uart_periph, USART_INT_RBNE);
        }

#ifdef RT_SERIAL_USING_DMA
        /* disable DMA */
        if (ctrl_arg == RT_DEVICE_FLAG_DMA_RX) {
            nvic_irq_disable(uart->dma_rx->irq);

            /* disable interrupt */
            usart_interrupt_disable(uart->uart_periph, USART_INT_IDLE);

            dma_channel_disable(uart->dma_rx->periph, uart->dma_rx->channel);
            usart_dma_receive_config(uart->uart_periph, USART_RECEIVE_DMA_DISABLE);
            gd32_dma_deinit(uart->dma_rx->periph, uart->dma_rx->channel);

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H77x) || defined(SOC_SERIES_GD32H75E)
            /* Free cache-aligned DMA buffer */
            if (uart->dma_rx_buffer != RT_NULL)
            {
                rt_free_align(uart->dma_rx_buffer);
                uart->dma_rx_buffer = RT_NULL;
            }
#endif

            uart->last_recv_index = 0;
        }
#ifdef BSP_SERIAL_USING_TX_DMA
        else if (ctrl_arg == RT_DEVICE_FLAG_DMA_TX) {
            nvic_irq_disable(uart->dma_tx->irq);

            dma_channel_disable(uart->dma_tx->periph, uart->dma_tx->channel);
            usart_dma_transmit_config(uart->uart_periph, USART_TRANSMIT_DMA_DISABLE);
            gd32_dma_deinit(uart->dma_tx->periph, uart->dma_tx->channel);
        }
#endif
#endif
        break;
    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        NVIC_EnableIRQ(uart->irqn);
#if defined SOC_SERIES_GD32E51x
        if (uart->uart_periph == USART5)
        {
            usart5_flag_clear(USART5, USART5_FLAG_RBNE);
            /* enable interrupt */
            usart5_interrupt_enable(USART5, USART5_INT_RBNE);
        }
        else
#endif
        {
            usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
            /* enable interrupt */
            usart_interrupt_enable(uart->uart_periph, USART_INT_RBNE);
        }
        break;

#ifdef RT_SERIAL_USING_DMA
    case RT_DEVICE_CTRL_CONFIG:
        if (ctrl_arg == RT_DEVICE_FLAG_DMA_RX) {
            gd32_dma_config(serial, ctrl_arg);
        }
#ifdef BSP_SERIAL_USING_TX_DMA
        else if (ctrl_arg == RT_DEVICE_FLAG_DMA_TX) {
            gd32_dma_tx_config(serial, ctrl_arg);
        }
#endif
        break;
#endif

    case RT_DEVICE_CTRL_CLOSE:
        usart_disable(uart->uart_periph);
        break;
    }

    return RT_EOK;
}

/**
  * @brief  uart put char
  * @param  serial, ch
  * @retval RT_EOK on success, -RT_ETIMEOUT on timeout
  */
static int gd32_uart_putc(struct rt_serial_device *serial, char ch)
{
    struct gd32_uart *uart;
    rt_tick_t start_tick;
    rt_tick_t timeout_ticks = rt_tick_from_millisecond(GD32_POLL_TX_TIMEOUT_MS);

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;
    usart_data_transmit(uart->uart_periph, ch);
#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        start_tick = rt_tick_get();
        while((usart5_flag_get(USART5, USART5_FLAG_TC) == RESET))
        {
            if ((rt_tick_get() - start_tick) > timeout_ticks)
            {
                return -RT_ETIMEOUT;
            }
        }
    }
    else
#endif
    {
        start_tick = rt_tick_get();
        while((usart_flag_get(uart->uart_periph, USART_FLAG_TBE) == RESET))
        {
            if ((rt_tick_get() - start_tick) > timeout_ticks)
            {
                return -RT_ETIMEOUT;
            }
        }
    }

    return RT_EOK;
}

/**
  * @brief  uart get char
  * @param  serial
  * @retval None
  */
static int gd32_uart_getc(struct rt_serial_device *serial)
{
    int ch;
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = (struct gd32_uart *)serial->parent.user_data;

    ch = -1;
#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        if (usart5_flag_get(USART5, USART5_FLAG_RBNE) != RESET)
            ch = usart_data_receive(USART5);
    }
    else
#endif
    {
        if (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET)
            ch = usart_data_receive(uart->uart_periph);
    }
    return ch;
}

#ifdef RT_SERIAL_USING_DMA

static void dma_uart_config(struct rt_serial_device *serial, uint32_t setting_recv_len,
                            void *mem_base_addr)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    dma_single_data_parameter_struct dma_init_struct;

    /* rx dma config */
    uart->setting_recv_len = setting_recv_len;
    /* Initialize last_recv_index to DMA counter initial value (circular mode) */
    uart->last_recv_index = setting_recv_len;
    gd32_dma_deinit(uart->dma_rx->periph, uart->dma_rx->channel);

    dma_single_data_para_struct_init(&dma_init_struct);
    dma_init_struct.direction    = DMA_PERIPH_TO_MEMORY;
    GD32_DMA_SET_MEMADDR(&dma_init_struct, (uint32_t)mem_base_addr);
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;
    GD32_DMA_SET_DATAWIDTH(&dma_init_struct, DMA_PERIPH_WIDTH_8BIT);
    dma_init_struct.number       = uart->setting_recv_len;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H77x) || defined(SOC_SERIES_GD32H75E)
    dma_init_struct.request      = uart->dma_rx->request;
#endif
    dma_init_struct.periph_addr  = (uint32_t)USART_DATA_RX(uart->uart_periph);
    dma_single_data_mode_init(uart->dma_rx->periph, uart->dma_rx->channel, &dma_init_struct);
#if defined(SOC_SERIES_GD32F5xx) || defined(SOC_SERIES_GD32F5HC)
    dma_channel_subperipheral_select(uart->dma_rx->periph, uart->dma_rx->channel, uart->dma_rx->subperiph);
#endif
    /* configure DMA mode - circular mode for continuous reception */
    dma_circulation_enable(uart->dma_rx->periph, uart->dma_rx->channel);

    dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF);
    dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF);
    /* Enable Full-Transfer and Half-Transfer interrupts for circular RX */
    dma_interrupt_enable(uart->dma_rx->periph, uart->dma_rx->channel, DMA_INT_FTF);
    dma_interrupt_enable(uart->dma_rx->periph, uart->dma_rx->channel, DMA_INT_HTF);
}

