GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart.c
        usart_flag_clear(uart->uart_periph, USART_FLAG_TBE);
        usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
        /* enable transmit idle interrupt */
        usart_interrupt_enable(uart->uart_periph, USART_INT_TC);

        usart_dma_transmit_config(uart->uart_periph, USART_TRANSMIT_DMA_ENABLE);
        /* tx dma interrupt config */
        nvic_irq_enable(uart->dma_tx->irq, 1, 0);

        dma_channel_enable(uart->dma_tx->periph, uart->dma_tx->channel);

        return size;
    }
    return 0;
}
#endif

/**
 * Unified DMA receive ISR handler for circular mode.
 * Handles IDLE, Half-Transfer and Full-Transfer interrupt events.
 * last_recv_index stores the DMA remaining counter at last processing point.
 *
 * @param serial serial device
 * @param isr_flag UART_RX_DMA_IT_IDLE_FLAG / UART_RX_DMA_IT_HT_FLAG / UART_RX_DMA_IT_TC_FLAG
 */
static void dma_recv_isr(struct rt_serial_device *serial, rt_uint8_t isr_flag)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;
    rt_base_t level;
    rt_size_t recv_len = 0;
    rt_size_t counter;

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H77x) || defined(SOC_SERIES_GD32H75E)
    struct rt_serial_rx_fifo *rx_fifo = (struct rt_serial_rx_fifo *)serial->serial_rx;
#endif

    level = rt_hw_interrupt_disable();
    counter = dma_transfer_number_get(uart->dma_rx->periph, uart->dma_rx->channel);

    switch (isr_flag)
    {
    case UART_RX_DMA_IT_IDLE_FLAG:
        /* IDLE: counter may be anywhere, handle both directions */
        if (counter <= uart->last_recv_index)
            recv_len = uart->last_recv_index - counter;
        else
            recv_len = uart->setting_recv_len + uart->last_recv_index - counter;
        break;

    case UART_RX_DMA_IT_HT_FLAG:
        /* Half-transfer: counter is decreasing, should be less than last */
        if (counter < uart->last_recv_index)
            recv_len = uart->last_recv_index - counter;
        break;

    case UART_RX_DMA_IT_TC_FLAG:
        /* Full-transfer: counter just reloaded, should be >= last */
        if (counter >= uart->last_recv_index)
            recv_len = uart->setting_recv_len + uart->last_recv_index - counter;
        break;
    }

    if (recv_len)
    {
#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H77x) || defined(SOC_SERIES_GD32H75E)
        /* Invalidate DMA buffer cache, then copy to rx_fifo->buffer */
        rt_size_t recv_start = uart->setting_recv_len - uart->last_recv_index;
        rt_hw_cpu_dcache_ops(RT_HW_CACHE_INVALIDATE, uart->dma_rx_buffer, serial->config.bufsz);
        if (recv_start + recv_len <= uart->setting_recv_len) {
            rt_memcpy(rx_fifo->buffer + recv_start,
                      uart->dma_rx_buffer + recv_start, recv_len);
        } else {
            rt_size_t first_part = uart->setting_recv_len - recv_start;
            rt_memcpy(rx_fifo->buffer + recv_start,
                      uart->dma_rx_buffer + recv_start, first_part);
            rt_memcpy(rx_fifo->buffer, uart->dma_rx_buffer, recv_len - first_part);
        }
#endif
        uart->last_recv_index = counter;
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
    }
    rt_hw_interrupt_enable(level);
}

/**
 * Serial port receive idle process. This need add to uart idle ISR.
 *
 * @param serial serial device
 */
static void dma_uart_rx_idle_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    dma_recv_isr(serial, UART_RX_DMA_IT_IDLE_FLAG);

    /* read a data for clear receive idle interrupt flag */
    usart_data_receive(uart->uart_periph);
    usart_flag_clear(uart->uart_periph, USART_FLAG_IDLE);
}

/**
 * DMA receive done process. This need add to DMA receive done ISR.
 * Uses circular mode: handles both half-transfer and full-transfer interrupts.
 *
 * @param serial serial device
 */
static void dma_rx_done_isr(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    /* Check and handle half-transfer interrupt */
    if (dma_flag_get(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF) != RESET) {
        dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_HTF);
        dma_recv_isr(serial, UART_RX_DMA_IT_HT_FLAG);
    }

    /* Check and handle full-transfer interrupt */
    if (dma_flag_get(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF) != RESET) {
        dma_flag_clear(uart->dma_rx->periph, uart->dma_rx->channel, DMA_FLAG_FTF);
        dma_recv_isr(serial, UART_RX_DMA_IT_TC_FLAG);
    }
}

#endif /* RT_SERIAL_USING_DMA */


/**
 * Uart common interrupt process. This need add to uart ISR.
 *
 * @param serial serial device
 */
static void GD32_UART_IRQHandler(struct rt_serial_device *serial)
{
    struct gd32_uart *uart = (struct gd32_uart *) serial->parent.user_data;

    RT_ASSERT(uart != RT_NULL);

#if defined SOC_SERIES_GD32E51x
    if (uart->uart_periph == USART5)
    {
        /* USART5 in mode Receiver */
        if ((usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart5_flag_clear(USART5, USART5_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart5_interrupt_flag_get(USART5, USART5_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart5_flag_clear(USART5, USART5_FLAG_TC);
            usart5_interrupt_disable(USART5, USART5_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart5_flag_get(USART5, USART5_FLAG_ORERR) == SET)
        {
            usart5_flag_clear(USART5, USART5_FLAG_ORERR);
        }
    }
    else
#endif
    {
        /* UART in mode Receiver -------------------------------------------------*/
	    if ((usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_RBNE) != RESET) &&
	        (usart_flag_get(uart->uart_periph, USART_FLAG_RBNE) != RESET))
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);
            /* Clear RXNE interrupt flag */
            usart_flag_clear(uart->uart_periph, USART_FLAG_RBNE);
        }
#ifdef RT_SERIAL_USING_DMA
        if(usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_IDLE) != RESET)
        {
            dma_uart_rx_idle_isr(serial);
        }
#endif
        if (usart_interrupt_flag_get(uart->uart_periph, USART_INT_FLAG_TC) != RESET)
        {
            /* clear interrupt */
            usart_flag_clear(uart->uart_periph, USART_FLAG_TC);
            usart_interrupt_disable(uart->uart_periph, USART_INT_TC);
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
        if (usart_flag_get(uart->uart_periph, USART_FLAG_ORERR) == SET)
        {
            usart_flag_clear(uart->uart_periph, USART_FLAG_ORERR);
        }
    }
}
static const struct rt_uart_ops gd32_uart_ops =
{
    .configure = gd32_uart_configure,
    .control = gd32_uart_control,
    .putc = gd32_uart_putc,
    .getc = gd32_uart_getc,
#ifndef BSP_SERIAL_USING_TX_DMA
    NULL,
#else
    .dma_transmit = gd32_dma_transmit,
#endif
};

/**
  * @brief  uart init
  * @param  None
  * @retval None
  */
int rt_hw_usart_init(void)
{
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;
    int i;

    int result;
    rt_uint32_t flag = 0;

    for (i = 0; i < sizeof(uart_obj) / sizeof(uart_obj[0]); i++)
    {
        uart_obj[i].serial->ops    = &gd32_uart_ops;
        uart_obj[i].serial->config = config;

        flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;
#if defined(RT_SERIAL_USING_DMA)
        flag |= RT_DEVICE_FLAG_DMA_RX;
#if defined(BSP_SERIAL_USING_TX_DMA)
        flag |= RT_DEVICE_FLAG_DMA_TX;
#endif
#endif
        /* register UART1 device */
        result = rt_hw_serial_register(uart_obj[i].serial,
                              uart_obj[i].device_name,
                              flag,
                              (void *)&uart_obj[i]);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif
